#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/logzio-testing/logzio-monitoring-tests/runs/run-2y5VYKDoqFy2g6GH

Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.integration_tests_helm_rg: Refreshing state... [id=/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm]
azurerm_kubernetes_cluster.integration_tests_helm_cluster: Refreshing state... [id=/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster]
azurerm_kubernetes_cluster_node_pool.integration_tests_helm_cluster_taint_nodepool: Refreshing state... [id=/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster/agentPools/taintnp]
azurerm_kubernetes_cluster_node_pool.integration_tests_helm_cluster_windows_nodepool: Refreshing state... [id=/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster/agentPools/winnp]
kubernetes_namespace.ns_monitoring: Refreshing state... [id=monitoring]
kubernetes_service.win_app_service: Refreshing state... [id=monitoring/windows-demo-app]
kubernetes_deployment.traces_app_sample: Refreshing state... [id=monitoring/jaeger-hotrod]
helm_release.logzio-monitoring: Refreshing state... [id=logzio-monitoring]
kubernetes_deployment.windows_app_sample: Refreshing state... [id=monitoring/windows-demo-app]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # azurerm_kubernetes_cluster.integration_tests_helm_cluster has changed
  ~ resource "azurerm_kubernetes_cluster" "integration_tests_helm_cluster" {
      + api_server_authorized_ip_ranges     = []
      ~ azure_policy_enabled                = false -> true
        id                                  = "/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster"
        name                                = "integration_tests_cluster"
        tags                                = {
            "Note"    = "Do not delete!"
            "Owners"  = "Integrations"
            "Purpose" = "Automated tests"
        }
        # (28 unchanged attributes hidden)

      ~ default_node_pool {
            name                         = "default"
          + node_taints                  = []
          + tags                         = {}
          + zones                        = []
            # (18 unchanged attributes hidden)
        }

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }



        # (3 unchanged blocks hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.integration_tests_helm_cluster_taint_nodepool has changed
  ~ resource "azurerm_kubernetes_cluster_node_pool" "integration_tests_helm_cluster_taint_nodepool" {
        id                     = "/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster/agentPools/taintnp"
        name                   = "taintnp"
        tags                   = {
            "Note"    = "Do not delete!"
            "Owners"  = "Integrations"
            "Purpose" = "Automated tests"
        }
      + zones                  = []
        # (23 unchanged attributes hidden)
    }

  # azurerm_kubernetes_cluster_node_pool.integration_tests_helm_cluster_windows_nodepool has changed
  ~ resource "azurerm_kubernetes_cluster_node_pool" "integration_tests_helm_cluster_windows_nodepool" {
        id                     = "/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster/agentPools/winnp"
        name                   = "winnp"
      + node_taints            = []
        tags                   = {
            "Note"    = "Do not delete!"
            "Owners"  = "Integrations"
            "Purpose" = "Automated tests"
        }
      + zones                  = []
        # (22 unchanged attributes hidden)
    }

  # azurerm_resource_group.integration_tests_helm_rg has changed
  ~ resource "azurerm_resource_group" "integration_tests_helm_rg" {
        id       = "/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm"
        name     = "integration-tests-helm"
      + tags     = {}
        # (1 unchanged attribute hidden)
    }

  # kubernetes_deployment.traces_app_sample has changed
  ~ resource "kubernetes_deployment" "traces_app_sample" {
        id               = "monitoring/jaeger-hotrod"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + annotations      = {}
            name             = "jaeger-hotrod"
            # (5 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)



          ~ template {
              ~ metadata {
                  + annotations = {}
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (16 unchanged attributes hidden)

                  ~ container {
                      + args                       = []
                      + command                    = []
                        name                       = "jaeger-hotrod"
                        # (8 unchanged attributes hidden)





                        # (5 unchanged blocks hidden)
                    }

                    # (1 unchanged block hidden)
                }
            }
            # (2 unchanged blocks hidden)
        }
    }

  # kubernetes_deployment.windows_app_sample has changed
  ~ resource "kubernetes_deployment" "windows_app_sample" {
        id               = "monitoring/windows-demo-app"
        # (1 unchanged attribute hidden)

      ~ metadata {
          + annotations      = {}
          ~ generation       = 0 -> 1
            name             = "windows-demo-app"
          + resource_version = "6016"
          + uid              = "15873992-df87-4471-bfb8-aa1dad9026b0"
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          + strategy {
              + type = "RollingUpdate"

              + rolling_update {
                  + max_surge       = "25%"
                  + max_unavailable = "25%"
                }
            }

          ~ template {
              ~ metadata {
                  + annotations = {}
                    name        = "windows-demo-app"
                    # (2 unchanged attributes hidden)
                }

              ~ spec {
                    # (11 unchanged attributes hidden)

                  ~ container {
                      + args                       = []
                      + command                    = []
                      + image_pull_policy          = "IfNotPresent"
                        name                       = "windows-demo-app"
                      + termination_message_policy = "File"
                        # (5 unchanged attributes hidden)


                      ~ resources {
                          ~ requests = {
                              ~ "cpu"    = "0.1" -> "100m"
                                # (1 unchanged element hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (1 unchanged block hidden)
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

  # kubernetes_namespace.ns_monitoring has changed
  ~ resource "kubernetes_namespace" "ns_monitoring" {
        id = "monitoring"

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "monitoring"
            # (3 unchanged attributes hidden)
        }
    }

  # kubernetes_service.win_app_service has changed
  ~ resource "kubernetes_service" "win_app_service" {
        id                     = "monitoring/windows-demo-app"
        # (2 unchanged attributes hidden)

      ~ metadata {
          + annotations      = {}
          + labels           = {}
            name             = "windows-demo-app"
            # (4 unchanged attributes hidden)
        }

      ~ spec {
          + external_ips                = []
          + load_balancer_source_ranges = []
            # (7 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.integration_tests_helm_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "integration_tests_helm_cluster" {
      - azure_policy_enabled                = true -> null
        id                                  = "/subscriptions/72170a3a-d85e-404e-88df-4c4f33648561/resourceGroups/integration-tests-helm/providers/Microsoft.ContainerService/managedClusters/integration_tests_cluster"
        name                                = "integration_tests_cluster"
        tags                                = {
            "Note"    = "Do not delete!"
            "Owners"  = "Integrations"
            "Purpose" = "Automated tests"
        }
        # (29 unchanged attributes hidden)





        # (5 unchanged blocks hidden)
    }

  # kubernetes_deployment.windows_app_sample is tainted, so must be replaced
-/+ resource "kubernetes_deployment" "windows_app_sample" {
      ~ id               = "monitoring/windows-demo-app" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ metadata {
          - annotations      = {} -> null
          ~ generation       = 1 -> (known after apply)
            name             = "windows-demo-app"
          ~ resource_version = "6016" -> (known after apply)
          ~ uid              = "15873992-df87-4471-bfb8-aa1dad9026b0" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

      ~ spec {
            # (5 unchanged attributes hidden)


          ~ strategy {
              ~ type = "RollingUpdate" -> (known after apply)

              ~ rolling_update {
                  ~ max_surge       = "25%" -> (known after apply)
                  ~ max_unavailable = "25%" -> (known after apply)
                }
            }

          ~ template {
              ~ metadata {
                  - annotations      = {} -> null
                  ~ generation       = 0 -> (known after apply)
                    name             = "windows-demo-app"
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                    # (1 unchanged attribute hidden)
                }

              ~ spec {
                  - active_deadline_seconds          = 0 -> null
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + service_account_name             = (known after apply)
                    # (10 unchanged attributes hidden)

                  ~ container {
                      - args                       = [] -> null
                      - command                    = [] -> null
                      ~ image_pull_policy          = "IfNotPresent" -> (known after apply)
                        name                       = "windows-demo-app"
                      ~ termination_message_policy = "File" -> (known after apply)
                        # (5 unchanged attributes hidden)

                      ~ port {
                          - host_port      = 0 -> null
                            # (2 unchanged attributes hidden)
                        }

                      ~ resources {
                          ~ requests = {
                              ~ "cpu"    = "100m" -> "0.1"
                                # (1 unchanged element hidden)
                            }
                            # (1 unchanged attribute hidden)
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

```

</details>

*Pusher: @yotamloe, Action: `pull_request`, Working Directory: ``, Workflow: `Test`*